cinema_back/app/Http/Controllers/Admin/AdvertisementController.php

select * from `advertisings` where `user_id` is null
select * from `advertisings` where `user_id` is not null
select * from `users` where `users`.`id` in (4)
select * from `advertisings`
---
    public function index()
    {
        $admin_advertisements = Advertising::where('user_id', null)->with('hall')->get();
        $user_advertisements = Advertising::whereNotNull('user_id')->with('user', 'hall')->get();
        $advertisements = Advertising::with('user', 'hall')->get();

update `advertisings` set `verified` = '1', `advertisings`.`updated_at` = '2022-03-01 17:14:15' where `id` = '3'
select * from `advertisings` where `user_id` is null
select * from `advertisings` where `user_id` is not null
select * from `users` where `users`.`id` in (4)
---
    public function verifyAdvertisement(Request $request){
        $data = $request->all();
        Advertising::where('id', $data['id'])->update([
            'verified' => $data['value']
        ]);
        $admin_advertisements = Advertising::where('user_id', null)->with('hall')->get();
        $user_advertisements = Advertising::whereNotNull('user_id')->with('user', 'hall')->get();

insert into `advertisings` (`title`, `duration`, `file`, `updated_at`, `created_at`) values ('1221212', '122', '3krU0f110H_videoplayback.mp4', '2022-02-28 23:15:20', '2022-02-28 23:15:20')
---
    public function store(Request $request){
        $data = $request->all();
        $file = $request->file();
        if($file){
            $filename = Str::random(10) . '_' . $data['file']->getClientOriginalName();
            $data['file']->move(public_path() . '/storage/videos/', $filename);
        }


        Advertising::create([
            'title' => $data['title'],
            'duration' => $data['duration'],
            'file' => &$filename,
        ]);