cinema_back/app/Http/Controllers/Admin/DocumentsController.php

    public function verifyDocument(Request $request){
        $request = $request->all();
        UploadDocs::where('id', $request['id'])->update([
            'verified' => 1
        ]);
        User::where('id', $request['user_id'])->update([
            'document_verified' => 2
        ]);
        $documents = UploadDocs::with('user')->get();
---
update `upload_docs` set `verified` = 1 where `id` = '100'
update `users` set `document_verified` = 2, `users`.`updated_at` = '2022-02-28 23:10:08' where `id` = '3'
select * from `upload_docs`
select * from `users` where `users`.`id` in (1, 3)

    public function index()
    {
        $documents = UploadDocs::with('user')->get();
---
select * from `upload_docs`
select * from `users` where `users`.`id` in (1, 3, 4)