cinema_back/app/Http/Controllers/Admin/GenreAdminController.php

select `id`, `title` from `genres` order by `title` asc
---
    public function index()
    {
        $genres = Genre::select('id','title')
            ->orderBy('title')
            ->get();