cinema_back/app/Http/Controllers/Admin/HallsAdminController.php

    public function index()
    {
        $halls = HallsInDocument::with('user')->get();
---
select * from `halls_in_document`
select * from `users` where `users`.`id` in (1, 3, 4)