cinema_back/app/Http/Controllers/Admin/ProjectorsAdminController.php

    public function index()
    {
        $projectors = Projector::with('user')->get();
---
select * from `projectors`