cinema_back/app/Http/Controllers/Admin/SeanceAdminController.php

    public function index()
    {
        // $items = Seance::with('film', 'status', 'user')->get();

        // foreach($items as $item){
        //     if($item->film->title == "upload film"){
        //         $item->delete();

        //     }
        // }

        $seances = Seance::with('film', 'status', 'user', 'advertisement')->get();
---
select * from `films` where `films`.`id` in (1)
select * from `seances`
select * from `users` where `users`.`id` in (1, 3)

    public function create()
    {
        $halls = HallsInDocument::all();
        $films = $this->filmService->films_active();
        $statuses = SeanceStatus::select('id', 'color', 'title')->get();
        $advertisement = Advertising::where('user_id', null)->get();
---
select * from `halls_in_document`
select `id`, `color`, `title` from `seance_statuses`
select * from `advertisings` where `user_id` is null

    public function store(Request $request)
    {
        $advertisement_id = [];
        foreach ($request->advertisement_id as $id){
            array_push($advertisement_id, (int) $id);
        }
        $item = Seance::add($request->all());
        $item->user_id = auth()->id();
        $item->film_id = $request->film_id;
        $item->tickets_price = $request->tickets_price;
        $item->isBoolean($request, 'is_repeat');
        $item->save();

        foreach ($advertisement_id as $advertising_id){
            SeanceAdvertisements::create([
                'seance_id' => $item->id,
                'advertisement_id' => $advertising_id,
            ]);
---
insert into `seances` (`film_id`, `hall_id`, `day`, `start`, `duration_advertising`, `duration_service`, `tickets_price`, `advertisement_id`, `status_id`, `user_id`, `is_repeat`, `updated_at`, `created_at`) values ('3', '2', 'Вторник', '02:30', '', '21', '123', '[1,6]', '1', '', 0, '2022-02-28 22:30:00', '2022-02-28 22:30:00')
insert into `seance_advertisements` (`seance_id`, `advertisement_id`, `updated_at`, `created_at`) values (17, 1, '2022-02-28 23:00:23', '2022-02-28 23:00:23')

    public function edit($id)
    {
        $halls = HallsInDocument::all();
        $item = Seance::find($id);
        $films = $this->filmService->films_active();
//        $seanceAdvertisements = SeanceAdvertisements::where('seance_id', $item['id'])->with('advertisings')->get();
//        dd($seanceAdvertisements);
//        $advertisement = Advertising::where('user_id', null)->get();
        $advertisements = SeanceAdvertisements::where('seance_id', $item['id'])->with('advertisings')->get();
        $statuses = SeanceStatus::select('id', 'color', 'title')
            ->get();
---
select * from `halls_in_document`
select * from `seances` where `seances`.`id` = '3' limit 1
select * from `advertisings` where `advertisings`.`id` in (2, 4)
select * from `seance_advertisements` where `seance_id` = 3
select `id`, `color`, `title` from `seance_statuses`

    public function update(Request $request, $id)
    {
        $data = $request->all();
        $item = Seance::find($id);
        if(array_key_exists('advertisement_id', $data)){
            $lastAdvertisement_id = $data['advertisement_id'];
            $advertisements_in_db = SeanceAdvertisements::where('seance_id', $item->id)->delete();
            foreach ($lastAdvertisement_id as $requestId){
                SeanceAdvertisements::create([
                    'seance_id' => $item->id,
                    'advertisement_id' => $requestId
                ]);
            }
        }else{
            SeanceAdvertisements::where('seance_id', $item->id)->delete();
        }

        $item->edit($request->all());
        $item->isBoolean($request, 'is_repeat');
        $item->save();
---
select * from `seances` where `seances`.`id` = '2' limit 1
delete from `seance_advertisements` where `seance_id` = 3
insert into `seance_advertisements` (`seance_id`, `advertisement_id`, `updated_at`, `created_at`) values (3, '2', '2022-03-01 21:06:36', '2022-03-01 21:06:36')
delete from `seance_advertisements` where `seance_id` = 2
update `seances` set `is_repeat` = 0, `seances`.`updated_at` = '2022-03-01 21:18:42' where `id` = 2