cinema_back/app/Http/Controllers/Admin/UserAdminController.php

    public function index()
    {
//        $users = $this->userService->get_users();
        $users = User::with('role')->get();
---
select * from `user_roles` where `user_roles`.`id` in (4, 5, 6)
select * from `users`