cinema_back/app/Http/Services/FilmService.php

    public function films_active()
    {
        $filmsQuery = Film::where('is_active',1)
            ->orderBy('title')
            ->with('genres','user');

        $films = $filmsQuery->get();
---
select * from `films` where `is_active` = 1 order by `title` asc
select * from `users` where `users`.`id` in (1)
select `genres`.*, `film_genre`.`film_id` as `pivot_film_id`, `film_genre`.`genre_id` as `pivot_genre_id` from `genres` inner join `film_genre` on `genres`.`id` = `film_genre`.`genre_id` where `film_genre`.`film_id` in (1)