cinema_back/app/Http/Controllers/Api/FilmController.php

    public function index()
    {
        return Film::orderBy('created_at', 'desc')->get();
---
select * from `films` order by `created_at` desc

    public function getMySeances(){
        $seances = Seance::where('user_id', Auth::id())->with('user')->get();
---
select * from `seances` where `user_id` = 4

    public function show($id)
    {
        $film = Film::where('id', $id)->with('genres',  'user')->first();
---
select * from `films` where `id` = '1' limit 1
select * from `users` where `users`.`id` in (1)
select `genres`.*, `film_genre`.`film_id` as `pivot_film_id`, `film_genre`.`genre_id` as `pivot_genre_id` from `genres` inner join `film_genre` on `genres`.`id` = `film_genre`.`genre_id` where `film_genre`.`film_id` in (1)