cinema_back/app/Http/Controllers/Api/HallController.php

select * from `upload_docs` where `user_id` = 3 limit 1
---
    public function getMyDocument(){
        $doc = UploadDocs::where('user_id', Auth::id())->first();

select * from `upload_docs` where `user_id` = 4 limit 1
---
    public function uploadData(Request $request){
        if(UploadDocs::where('user_id', Auth::id())->first() !== null){

insert into `halls_in_document` (`user_id`, `name_theatre`, `name_hall`, `region`, `city`, `house`, `hall_seats`, `hall_rows`, `voice_hardware`, `screen_width`, `screen_length`) values (4, 'adadadad', '123123123', 'Белгородская', 'awdawd', 'awdawdaw', 144, '12', 'wdadawd', '12', '12')
update `users` set `document_verified` = 1, `users`.`updated_at` = '2022-03-01 07:35:38' where `email` = 'awdwad@wd.awd'
---

            $info = $request->all();
            for($i=0; $i<$request['hall_count']+1; $i++){
                HallsInDocument::create([
                    'user_id' => Auth::id(),
                    'name_theatre' => $info['name_theatre'],
                    'name_hall' => json_decode($request['new_hall_name'])[$i],
                    'region' => $info['region'],
                    'city' => $info['city'],
                    'house' => $info['house'],
                    'hall_seats' => json_decode($request['new_hall_seat_count'])[$i] * json_decode($request['new_hall_row_count'])[$i],
                    'hall_rows' => json_decode($request['new_hall_row_count'])[$i],
                    'voice_hardware' => json_decode($request['new_hall_voice_desc'])[$i],
                    'screen_width' => json_decode($request['new_hall_screen_width'])[$i],
                    'screen_length' => json_decode($request['new_hall_screen_length'])[$i],
                ]);
            }
            User::where('email', Auth::user()->email)->update(['document_verified' => 1]);

select * from `halls_in_document` where `user_id` = 7
---
    public function index()
    {
        return HallsInDocument::where('user_id', Auth::id())->get();

select * from `advertisings` where `user_id` = 4 and `verified` = 1
---
    public function getMyAdvertisements(){
        $advertisings = Advertising::where('user_id', Auth::id())->where('verified', 1)->get();

select * from `films` order by `rating` desc
---
    public function getFilms(){
        $films = Film::orderBy('rating', 'desc')->get();

select * from `advertisings` where `user_id` = 4
---
    public function myAdvertisement(){
        $advertisements = Advertising::where('user_id', Auth::id())->get();

select * from `advertisings` where `id` = 1 limit 1
---
    public function getAdvertisement(Request $request){
        $advertisements = [];
        $data = $request->all();
        foreach ($data['advertising_id'] as $advertising_id){
            $advertising = Advertising::where('id', $advertising_id)->first();

insert into `advertisings` (`user_id`, `title`, `duration`, `file`, `updated_at`, `created_at`) values (3, 'aaaaaaa', '23', '1646094042_videoplayback.mp4', '2022-03-01 00:20:42', '2022-03-01 00:20:42')
---
    public function addAdvertisement(Request $request){
        $files = $request->all();
        $file = $request->file();
//
//        $request->validate([
//            'title' => 'required',
//            'duration' => 'required',
//            'file' => 'required'
//        ]);
        if($file){
            $files['file']->store('public/videos');
            $filename = Carbon::now()->timestamp . '_' . $files['file']->getClientOriginalName();
            $files['file']->move(public_path().'/storage/videos', $filename);
        }

        Advertising::create([
            'user_id' => Auth::id(),
            'title' => $files['title'],
            'duration' => $files['duration'],
            'file' => &$filename,
        ]);