cinema_back/app/Http/Controllers/Api/JwtAuthController.php

select * from `users` where `email` = 'asdasd@awd.awd' limit 1
---
    public function sendCode(Request $request)
    {
        if ($request->email) {
            $user = User::where('email', $request->email)->first();

insert into `users` (`name`, `email`, `country_code`, `phone`, `role_id`, `percent`, `updated_at`, `created_at`) values ('wad', 'awdaw@awd.awd', 7, '123123123', 6, 50, '2022-03-01 07:21:32', '2022-03-01 07:21:32')
---
    public function register(Request $request)
    {
        $validator =  Validator::make($request->all(),[
            'name' => 'required',
            'email' => 'required|email|unique:users,email,',
            'country_code' => 'required|numeric',
            'phone' => 'required|numeric',
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => $validator->errors()], 422);
        }
        if($request->role_id == 'cinema'){
            $request['role_id']=6;
            $request['percent'] = 50;
        }else{
            $request['role_id']=4;
            $request['percent'] = 25;
        }
        $user = User::create($request->all());