cinema_back/app/Http/Controllers/Api/SeanceController.php

select * from `films` where `films`.`id` in (3, 4)
select * from `seances` where `user_id` = 7 and date(`day`) > '2022-02-27'
select * from `users` where `users`.`id` in (7)
---
    public function index()
    {
        $seances = Seance::where('user_id', Auth::id())
            ->whereDate('day', '>', Carbon::today()->subDays(1))
            ->with('film', 'user', 'halls')
            ->get();

select * from `films` where `films`.`id` in (1)
select * from `seances` where `film_id` = '1' and date(`day`) = '2022-03-01'
---
    public function currentFilmSeanceByDay($id, Request $request){
        $data = $request->all();
        $seance = Seance::where('film_id', $id)->whereDate('day', '=', $data['day'])->with('halls', 'film')->get();

insert into `seance_advertisements` (`seance_id`, `advertisement_id`, `updated_at`, `created_at`) values (6, 3, '2022-03-01 00:21:04', '2022-03-01 00:21:04')
---

        if ($item->save()) {
            foreach (json_decode($request->advertisement_id) as $id){
                SeanceAdvertisements::create([
                    'seance_id' => $item->id,
                    'advertisement_id' => $id,
                ]);