cinema_back/app/Http/Controllers/ProjectorController.php

select * from `projectors` order by `id` desc
---
    public function show(){
        $projectors = Projector::orderBy('id', 'DESC')->get();